# Desafio 1

Para esse desafio, vamos trabalhar com o data set [Black Friday](https://www.kaggle.com/mehdidag/black-friday), que reúne dados sobre transações de compras em uma loja de varejo.

Vamos utilizá-lo para praticar a exploração de data sets utilizando pandas. Você pode fazer toda análise neste mesmo notebook, mas as resposta devem estar nos locais indicados.

> Obs.: Por favor, não modifique o nome das funções de resposta.

## _Set up_ da análise

In [2]:
import pandas as pd
import numpy as np

In [3]:
black_friday = pd.read_csv("black_friday.csv")

## Inicie sua análise a partir daqui

#### QUESTÃO 1 - NÚMERO OBSERVAÇÕES E COLUNAS

In [4]:
bf_dataframe = pd.DataFrame(black_friday)
bf_dataframe.shape

(537577, 12)

In [5]:
bf_dataframe.head(15)

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969
5,1000003,P00193542,M,26-35,15,A,3,0,1,2.0,NaN,15227
6,1000004,P00184942,M,46-50,7,B,2,1,1,8.0,17.0,19215
7,1000004,P00346142,M,46-50,7,B,2,1,1,15.0,NaN,15854
8,1000004,P0097242,M,46-50,7,B,2,1,1,16.0,NaN,15686
9,1000005,P00274942,M,26-35,20,A,1,1,8,NaN,NaN,7871
10,1000005,P00251242,M,26-35,20,A,1,1,5,11.0,NaN,5254
11,1000005,P00014542,M,26-35,20,A,1,1,8,NaN,NaN,3957
12,1000005,P00031342,M,26-35,20,A,1,1,8,NaN,NaN,6073
13,1000005,P00145042,M,26-35,20,A,1,1,1,2.0,5.0,15665
14,1000006,P00231342,F,51-55,9,A,1,0,5,8.0,14.0,5378

#### QUESTÃO 3 - NÚMERO DE USUÁRIOS ÚNICOS

In [6]:
bf_dataframe['User_ID'].value_counts()

1001680    1025
1004277     978
1001941     898
1001181     861
1000889     822
           ...
1005810       6
1005391       6
1005608       6
1002111       6
1000708       5
Name: User_ID, Length: 5891, dtype: int64

#### QUESTÃO 4 - QUANTOS TIPOS DE DADOS EXISTEM ?

In [7]:
bf_dataframe.dtypes.value_counts().shape[0]

3

In [8]:
n=0
for i in bf_dataframe['Product_Category_3']:
    if i == 19:
        n+=1
n

0

#### QUESTÃO 5 - PORCENTAGEM DE REGISTROS COM PELO MENOS UM DADOS VAZIO

In [9]:
bf_dataframe.isna().sum()['Product_Category_3']/bf_dataframe.count()[0]

0.6944102891306734

#### QUESTÃO 8 - MÉDIA DE PURCHASE DEPOIS DA NORMALIZAÇÃO

In [10]:
bf_normalized = (bf_dataframe['Purchase'] - bf_dataframe['Purchase'].min())/(bf_dataframe['Purchase'].max()-bf_dataframe['Purchase'].min())

In [11]:
bf_normalized.mean()

0.38479390362696736

#### QUESTÃO 7 - VALOR MAIS FREQUENTE DE PRODUCT_CATEGORY 3

In [12]:
bf_dataframe['Product_Category_3'].mode()[0]

16.0

#### QUESTÃO 6 - QUANTOS VALORES NULOS EXISTEM NA COLUNA COM MAIS VALURES NULOS ?

In [13]:
bf_dataframe.isna().sum()['Product_Category_3']

373299

#### QUESTÃO 9 - QUANTOS VALORES ENTRE -1 E 1 EXISTEM EM PURCHASE DEPOIS DE PADRONIZAÇÃO

In [14]:
bf_std = (bf_dataframe['Purchase'] - bf_dataframe['Purchase'].mean())/(bf_dataframe['Purchase'].std())

In [15]:
bf_std

0        -0.193506
1         1.177698
2        -1.588401
3        -1.661679
4        -0.274012
            ...
537572    0.467804
537573    1.979943
537574   -0.259156
537575   -0.434019
537576   -0.493646
Name: Purchase, Length: 537577, dtype: float64

In [16]:
j = 0
for lines in bf_std:
    if -1 < lines < 1:
        j+=1
j

348631

#### QUESTÃO 10 - SE PRODUCT_CATEGORY 2 É NULO, PRODUCT_CATEGORY 3 TAMBÉM É ?

In [17]:
k = 0
for index, row in bf_dataframe[['Product_Category_2','Product_Category_3']].iterrows():
    if pd.isna(row['Product_Category_2']) == True and pd.isna(row['Product_Category_3']) == False:
        k+=1
k

0

In [18]:
bf_dataframe[['Product_Category_2','Product_Category_3']]

        Product_Category_2  Product_Category_3
0                      NaN                 NaN
1                      6.0                14.0
2                      NaN                 NaN
3                     14.0                 NaN
4                      NaN                 NaN
...                    ...                 ...
537572                 2.0                 NaN
537573                15.0                16.0
537574                15.0                 NaN
537575                 NaN                 NaN
537576                 8.0                 NaN

[537577 rows x 2 columns]

In [19]:
bf_dataframe.isna().sum()

User_ID                            0
Product_ID                         0
Gender                             0
Age                                0
Occupation                         0
City_Category                      0
Stay_In_Current_City_Years         0
Marital_Status                     0
Product_Category_1                 0
Product_Category_2            166986
Product_Category_3            373299
Purchase                           0
dtype: int64

#### Questão 2 - Quantas mulheres com idade entre 26 e 35 anos no dataset?

In [20]:
bf_dataframe

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969
...,...,...,...,...,...,...,...,...,...,...,...,...
537572,1004737,P00193542,M,36-45,16,C,1,0,1,2.0,NaN,11664
537573,1004737,P00111142,M,36-45,16,C,1,0,1,15.0,16.0,19196
537574,1004737,P00345942,M,36-45,16,C,1,0,8,15.0,NaN,8043
537575,1004737,P00285842,M,36-45,16,C,1,0,5,NaN,NaN,7172
537576,1004737,P00118242,M,36-45,16,C,1,0,5,8.0,NaN,6875

In [21]:
filtered_df = bf_dataframe[(bf_dataframe.Gender =='F') & (bf_dataframe.Age =='26-35')]

In [22]:
filtered_df['User_ID'].value_counts()

1001150    752
1003224    622
1003539    616
1000752    572
1001448    570
          ...
1005027      9
1005117      8
1004776      8
1004992      8
1003291      7
Name: User_ID, Length: 545, dtype: int64

## Questão 1

Quantas observações e quantas colunas há no dataset? Responda no formato de uma tuple `(n_observacoes, n_colunas)`.

In [24]:
def q1():
    bf_dataframe.shape
    return bf_dataframe.shape

## Questão 2

Há quantas mulheres com idade entre 26 e 35 anos no dataset? Responda como um único escalar.

In [23]:
bf_dataframe['Age']

0          0-17
1          0-17
2          0-17
3          0-17
4           55+
          ...
537572    36-45
537573    36-45
537574    36-45
537575    36-45
537576    36-45
Name: Age, Length: 537577, dtype: object

In [24]:
def q2():
    return 545

## Questão 3

Quantos usuários únicos há no dataset? Responda como um único escalar.

In [26]:
def q3():
    return bf_dataframe['User_ID'].value_counts().shape[0]

## Questão 4

Quantos tipos de dados diferentes existem no dataset? Responda como um único escalar.

In [28]:
def q4():
    return bf_dataframe.dtypes.value_counts().shape[0]

## Questão 5

Qual porcentagem dos registros possui ao menos um valor null (`None`, `ǸaN` etc)? Responda como um único escalar entre 0 e 1.

In [27]:
def q5():
    return 0.6944102891306734

## Questão 6

Quantos valores null existem na variável (coluna) com o maior número de null? Responda como um único escalar.

In [28]:
def q6():
    return 373299

## Questão 7

Qual o valor mais frequente (sem contar nulls) em `Product_Category_3`? Responda como um único escalar.

In [29]:
def q7():
    return bf_dataframe['Product_Category_3'].mode()[0]

## Questão 8

Qual a nova média da variável (coluna) `Purchase` após sua normalização? Responda como um único escalar.

In [30]:
def q8():
    bf_normalized = (bf_dataframe['Purchase'] - bf_dataframe['Purchase'].min())/(bf_dataframe['Purchase'].max()-bf_dataframe['Purchase'].min())
    return bf_normalized.mean()

## Questão 9

Quantas ocorrências entre -1 e 1 inclusive existem da variáel `Purchase` após sua padronização? Responda como um único escalar.

In [31]:
def q9():
    return 348631

## Questão 10

Podemos afirmar que se uma observação é null em `Product_Category_2` ela também o é em `Product_Category_3`? Responda com um bool (`True`, `False`).

In [32]:
def q10():
    return True